{
    "title": "Közeli Közösség",
    "subtitle": "Csatlakozz és Csevegj a Közelben - Funkció Grafika",
    "sizeIndicator": "Jelenlegi konténer szélessége",
    "fullWidth": "Teljes Szélesség",
    "featuresTitle": "Funkciók",
    "feature1": "Teljesen reszponzív SVG, amely minden képernyőmérethez alkalmazkodik",
    "feature2": "WiFi Direct és Bluetooth kapcsolat",
    "feature3": "Peer-to-peer üzenetküldés internet nélkül",
    "feature4": "Gyönyörű gradiens dizájn sima animációkkal",
    "feature5": "Interaktív szélesség vezérlők a reszponzivitás teszteléséhez",
    "feedback": {
        "buttonText": "Visszajelzés",
        "title": "Közösségi Fórum",
        "subtitle": "Oszd meg visszajelzésed, jelentsd a hibákat és javasolj fejlesztéseket",
        "description": "Csatlakozz a beszélgetéshez! Oszd meg gondolataidat, jelentsd a problémákat és segíts nekünk együtt fejleszteni a Közeli Közösséget.",
        "filterByVersion": "Szűrés verzió szerint",
        "allVersions": "Összes verzió",
        "filterByTopic": "Szűrés téma szerint",
        "allTopics": "Összes téma",
        "topicFeedback": "Visszajelzés",
        "topicBug": "Hiba",
        "topicEnhancement": "Fejlesztés",
        "addMessage": "Üzenet hozzáadása",
        "nameLabel": "Név vagy becenév",
        "namePlaceholder": "Add meg a neved vagy beceneved",
        "versionLabel": "Alkalmazás verzió",
        "selectVersion": "Válassz verziót",
        "topicLabel": "Téma",
        "selectTopic": "Válassz témát",
        "emailLabel": "Email címed (opcionális)",
        "emailPlaceholder": "email.cimed@pelda.hu",
        "messageLabel": "Üzeneted",
        "messagePlaceholder": "Mondd el, mit gondolsz...",
        "submitButton": "Üzenet küldése",
        "submitting": "Küldés...",
        "cancelButton": "Mégse",
        "successMessage": "Üzenet sikeresen elküldve!",
        "successDescription": "Az üzeneted hozzá lett adva a fórumhoz. Köszönjük a hozzájárulásod!",
        "addAnother": "Újabb üzenet hozzáadása",
        "errorName": "Kérjük, add meg a neved vagy beceneved.",
        "errorVersion": "Kérjük, válassz egy alkalmazás verziót.",
        "errorTopic": "Kérjük, válassz egy témát.",
        "errorMessage": "Kérjük, írd be az üzenetedet.",
        "errorRecaptcha": "reCAPTCHA ellenőrzés sikertelen. Kérjük, próbáld újra.",
        "recaptchaNotice": "Ez az oldal a reCAPTCHA védelme alatt áll, és a Google Adatvédelmi irányelvei és Szolgáltatási feltételei érvényesek.",
        "messagesTitle": "Közösségi üzenetek",
        "messagesCount": "üzenet",
        "noMessages": "Nincsenek üzenetek. Légy az első, aki megosztja gondolatait!",
        "today": "Ma",
        "yesterday": "Tegnap",
        "daysAgo": "napja",
        "justNow": "Épp most",
        "minutesAgo": "perce",
        "hoursAgo": "órája",
        "comments": "Hozzászólások",
        "addComment": "Hozzászólás hozzáadása",
        "hideCommentForm": "Űrlap elrejtése",
        "commentNameLabel": "Neved",
        "commentNamePlaceholder": "Add meg a neved",
        "adminPasswordLabel": "Admin jelszó",
        "adminPasswordPlaceholder": "Add meg az admin jelszót",
        "adminPasswordHint": "Csak adminisztrátorok írhatnak hozzászólást",
        "commentMessageLabel": "Hozzászólás",
        "commentMessagePlaceholder": "Írd meg a hozzászólásodat...",
        "postComment": "Hozzászólás küldése",
        "adminBadge": "Admin",
        "errorCommentName": "Kérjük, add meg a neved.",
        "errorCommentPassword": "Kérjük, add meg az admin jelszót.",
        "errorCommentMessage": "Kérjük, írd be a hozzászólásodat.",
        "errorInvalidPassword": "Érvénytelen admin jelszó. Csak adminisztrátorok írhatnak hozzászólást.",
        "contactEmail": "nearcomapp@gmail.com"
    },
    "privacyPolicy": {
        "title": "Adatvédelmi irányelvek",
        "lastUpdated": "Utolsó frissítés: 2026. január 7.",
        "intro": {
            "title": "Bevezetés",
            "content": "Ez az Adatvédelmi irányelv leírja, hogyan kezeli a Közeli Közösség (\"mi\", \"miénk\" vagy \"az alkalmazás\") az információkat, amikor mobilalkalmazásunkat használja. Elkötelezettek vagyunk magánélete védelme és adatkezelési gyakorlataink átláthatósága iránt. Ez az alkalmazás az adatvédelmet alapelvként szem előtt tartva készült - peer-to-peer alapon működünk, központi szerverek nélkül."
        },
        "dataCollection": {
            "title": "1. Általunk gyűjtött információk",
            "content": "A Közeli Közösség úgy lett tervezve, hogy minimalizálja az adatgyűjtést. Az alkalmazás a következő információkat gyűjti és dolgozza fel helyileg az eszközén:\n\n• Eszközazonosító: Egy ideiglenes, titkosított azonosító az eszközök felderítéséhez\n• Avatar név: A megjelenítendő név, amelyet a közeli felhasználókkal oszt meg\n• Csevegési üzenetek: Az aktív munkamenetek során küldött és fogadott üzenetek\n• Eszközinformációk: Alapvető eszközadatok a Bluetooth és Wi-Fi Direct kapcsolathoz\n\nFONTOS: Minden adat helyileg kerül feldolgozásra az eszközén. Nem gyűjtünk, tárolunk vagy továbbítunk személyes információkat külső szerverekre vagy harmadik feleknek."
        },
        "permissions": {
            "title": "2. Szükséges engedélyek",
            "content": "A peer-to-peer kapcsolat biztosításához az alkalmazás a következő engedélyeket igényli:\n\n• Bluetooth keresés, csatlakozás és hirdetés: Közeli eszközök felfedezéséhez és csatlakozásához Bluetooth Low Energy (BLE) használatával\n• Közeli Wi-Fi eszközök: Wi-Fi Direct kapcsolatok engedélyezéséhez gyorsabb adatátvitelhez (Android 13+)\n• Helymeghatározás (Android 13 és korábbi): Az Android operációs rendszer által megkövetelt a Bluetooth kereséshez régebbi verziókon. NEM követjük nyomon a tartózkodási helyét\n• Értesítések: Új üzenetek és kapcsolati események értesítéséhez\n\nEzeket az engedélyeket kizárólag peer-to-peer funkcionalitáshoz használjuk, és soha nem használjuk Önről adatok követésére, megfigyelésére vagy gyűjtésére."
        },
        "dataUsage": {
            "title": "3. Hogyan használjuk az információkat",
            "content": "Az alkalmazás által feldolgozott információkat kizárólag a következőkre használjuk:\n\n• Eszközfelderítés: Lehetővé teszi, hogy megtalálja és megtalálják a közeli eszközöket\n• Peer-to-peer kommunikáció: Közvetlen üzenetküldés elősegítése eszközök között\n• Kapcsolatkezelés: Stabil kapcsolatok fenntartása aktív munkamenetek során\n• Felhasználói élmény: A választott avatar név megjelenítése más felhasználók számára\n\nMinden feldolgozás helyileg történik az eszközén. Az üzenetek és kapcsolatok átmenetiek - csak aktív munkamenetek során léteznek, és nem kerülnek tartósan tárolásra vagy külső szerverekre továbbításra."
        },
        "dataStorage": {
            "title": "4. Adattárolás és megőrzés",
            "content": "• Csak helyi tárolás: Minden adat helyileg kerül tárolásra az eszközén titkosított adatbázisok használatával\n• Nincs felhőalapú tárolás: Nem töltjük fel és nem szinkronizáljuk adatait felhőszolgáltatásokra\n• Ideiglenes adatok: Az eszközfelderítési információk és aktív kapcsolatok átmenetiek és automatikusan törlődnek\n• Csevegési előzmények: Az üzenetek helyileg kerülnek tárolásra az eszközén, és bármikor törölhetők\n• Felhasználói kontroll: Teljes kontrollja van az adatai felett, és törölheti azokat az alkalmazás eltávolításával"
        },
        "dataSharing": {
            "title": "5. Adatmegosztás és közzététel",
            "content": "NEM osztjuk meg, adjuk el, béreljük ki vagy tesszük közzé az információit harmadik felek számára. Az alkalmazás teljes mértékben peer-to-peer alapon működik:\n\n• Nincsenek harmadik féltől származó szolgáltatások: Nem integrálunk elemzési, hirdetési vagy követési szolgáltatásokat\n• Nincs adatátvitel: Az adatai soha nem hagyják el az eszközét, kivéve a közvetlen peer-to-peer kommunikáció során olyan eszközökkel, amelyekhez kifejezetten csatlakozik\n• Felhasználó által vezérelt megosztás: Ön szabályozza, milyen információkat oszt meg az avatar név és az elküldött üzenetek kiválasztásával\n• Nincsenek kormányzati vagy jogi kérések: Mivel nem gyűjtjük vagy tároljuk az adatait, nincs mit szolgáltatnunk harmadik feleknek"
        },
        "security": {
            "title": "6. Biztonsági intézkedések",
            "content": "Több biztonsági intézkedést alkalmazunk az információi védelmére:\n\n• Végpontok közötti titkosítás: Minden peer-to-peer kommunikáció titkosított\n• Titkosított tárolás: A helyi adatbázisok titkosítást használnak a tárolt adatok védelmére\n• Biztonságos azonosítók: Az eszközazonosítók titkosítottak és átmenetiek\n• Nincs központi meghibásodási pont: A peer-to-peer architektúra kiküszöböli a szerver alapú sebezhetőségeket\n• Engedélyvezérlés: Az Android engedélyrendszere biztosítja, hogy Ön szabályozza, mihez férhet hozzá az alkalmazás"
        },
        "childrenPrivacy": {
            "title": "7. Gyermekek adatvédelme",
            "content": "A Közeli Közösség tudatosan nem gyűjt információkat 13 év alatti gyermekektől. Az alkalmazás általános közönségnek készült, és nem célozza meg a gyermekeket. Mivel nem gyűjtünk személyes információkat és nem használunk központi szervereket, nem tudjuk meghatározni a felhasználók életkorát. A szülőknek és gondviselőknek felügyelniük kell a gyermekek alkalmazáshasználatát, és biztosítaniuk kell, hogy megértsék a biztonságos kommunikációs gyakorlatokat."
        },
        "yourRights": {
            "title": "8. Az Ön adatvédelmi jogai",
            "content": "Teljes kontrollja van az adatai felett:\n\n• Hozzáférés: Minden adata helyileg van tárolva az eszközén és Ön számára elérhető\n• Törlés: Az alkalmazás eltávolítása véglegesen törli az összes helyi adatot\n• Kontroll: Ön választja meg, milyen információkat oszt meg és kivel\n• Átláthatóság: Ez az irányelv pontosan elmagyarázza, milyen adatok kerülnek feldolgozásra és hogyan\n• Nincs követés: Nem követjük nyomon viselkedését, tartózkodási helyét vagy használati mintáit\n\nMivel nem gyűjtjük vagy tároljuk az adatait külső szervereken, nincs szükség adathordozhatósági vagy javítási kérelmekre - már most is teljes kontrollja van."
        },
        "thirdParty": {
            "title": "9. Harmadik féltől származó szolgáltatások",
            "content": "A Közeli Közösség NEM integrál semmilyen harmadik féltől származó szolgáltatást, beleértve:\n\n• Nincsenek elemzési szolgáltatások: Nem használunk Google Analytics-et, Firebase Analytics-et vagy hasonló szolgáltatásokat\n• Nincsenek hirdetési hálózatok: Az alkalmazás reklammentes és nem integrál hirdetési SDK-kat\n• Nincs közösségi média integráció: Nem kapcsolódunk közösségi média platformokhoz\n• Nincsenek felhőszolgáltatások: Nem használunk felhőalapú tárolást vagy biztonsági mentési szolgáltatásokat\n• Nincs összeomlás-jelentés: Nem használunk harmadik féltől származó összeomlás-jelentési eszközöket\n\nEz biztosítja, hogy adatai privátak maradjanak, és soha ne kerüljenek megosztásra külső felekkel."
        },
        "international": {
            "title": "10. Nemzetközi adatátvitelek",
            "content": "Mivel a Közeli Közösség teljes mértékben peer-to-peer alapon működik központi szerverek nélkül, nincsenek nemzetközi adatátvitelek szervezetünkbe vagy onnan. Amikor egy másik felhasználóhoz csatlakozik, az adatok közvetlenül kerülnek továbbításra az eszközök között helyi vezeték nélküli technológiák (Bluetooth és Wi-Fi Direct) használatával. Az adatátvitel földrajzi helye kizárólag attól függ, hogy Ön és az eszközök, amelyekhez csatlakozik, fizikailag hol találhatók."
        },
        "changes": {
            "title": "11. Az irányelv módosításai",
            "content": "Időről időre frissíthetjük ezt az Adatvédelmi irányelvet, hogy tükrözze gyakorlataink változásait vagy jogi, működési vagy szabályozási okokból. Amikor lényeges változtatásokat végzünk:\n\n• Frissítjük az \"Utolsó frissítés\" dátumot az irányelv tetején\n• Értesítjük a felhasználókat az alkalmazáson vagy az alkalmazásbolt frissítési megjegyzésein keresztül\n• Legalább 30 nappal előre értesítünk jelentős változásokról\n\nAz alkalmazás folyamatos használata a változások hatályba lépése után a frissített irányelv elfogadását jelenti. Javasoljuk, hogy rendszeresen tekintse át ezt az irányelvet."
        },
        "compliance": {
            "title": "12. Jogi megfelelés",
            "content": "A Közeli Közösség úgy lett tervezve, hogy megfeleljen:\n\n• GDPR (Általános Adatvédelmi Rendelet): Európai adatvédelmi szabványok\n• CCPA (Kaliforniai Fogyasztói Adatvédelmi Törvény): Kaliforniai adatvédelmi jogok\n• COPPA (Gyermekek Online Adatvédelmi Védelmi Törvénye): Gyermekek adatvédelmének védelme\n• Google Play Áruház irányelvek: Android alkalmazás terjesztési követelmények\n\nA peer-to-peer, szerver nélküli architektúránk eredendően erős adatvédelmi védelmet nyújt, amely meghaladja sok szabályozási követelményt."
        },
        "contact": {
            "title": "13. Kapcsolatfelvétel",
            "content": "Ha kérdései, aggályai vagy kérései vannak ezzel az Adatvédelmi irányelvvel vagy adatvédelmi gyakorlatainkkal kapcsolatban, kérjük, lépjen kapcsolatba velünk:\n\n• Alkalmazás támogatás: Használja az alkalmazáson belüli támogatási csatornákat\n• E-mail: Kapcsolattartási információk elérhetők weboldalunkon\n• Alkalmazásbolt: Hagyjon visszajelzést a Google Play Áruházban\n\nElkötelezettek vagyunk adatvédelmi aggályainak gyors és átlátható kezelése iránt. Az Ön magánélete és bizalma fontos számunkra."
        }
    },
    "childSafety": {
        "title": "Gyermekvédelem és visszaélések elleni fellépés",
        "lastUpdated": "Utolsó frissítés: 2026. február 4.",
        "intro": {
            "title": "Bevezetés",
            "content": "A Közeli Közösség elkötelezett amellett, hogy biztonságos környezetet biztosítson minden felhasználó számára. Ez a Gyermekvédelmi és visszaélések elleni fellépési (CSAE) irányelv vázolja biztonsági szabványainkat, kapcsolattartási információinkat és intézkedéseinket a felhasználók, különösen a kiskorúak védelmére, a Google Play gyermekvédelmi szabványokra vonatkozó irányelvének megfelelően a közösségi és társkereső kategóriájú alkalmazások számára."
        },
        "commitment": {
            "title": "1. Elkötelezettségünk a gyermekvédelem iránt",
            "content": "Elkötelezettek vagyunk:\n\n• A kiskorúak védelme a nem megfelelő tartalomtól és interakcióktól\n• A gyermekek szexuális bántalmazásának és kizsákmányolásának (CSAE) megelőzése\n• Zéró tolerancia politika fenntartása az illegális tartalommal szemben\n• Átlátható biztonsági szabványok és jelentési mechanizmusok biztosítása\n• Teljes körű együttműködés a bűnüldöző szervekkel\n• Biztonsági intézkedéseink és irányelveink folyamatos fejlesztése"
        },
        "ageRequirements": {
            "title": "2. Korhatár követelmények",
            "content": "A Közeli Közösség a következő korhatár követelményekkel rendelkezik:\n\n• Minimális életkor: A felhasználóknak legalább 13 évesnek kell lenniük\n• Szülői beleegyezés: A 18 év alatti felhasználóknak szülői felügyelettel kell rendelkezniük\n• Életkor ellenőrzés: Bár nem gyűjtünk személyes adatokat, a felhasználók felelősek a korhatár követelmények teljesítéséért\n• Tinédzserek biztonsága: Szülői útmutatást javasolunk minden 18 év alatti felhasználó számára\n\nAz alkalmazás használatával Ön megerősíti, hogy megfelel a joghatóságában érvényes minimális korhatárnak."
        },
        "safetyFeatures": {
            "title": "3. Biztonsági funkciók",
            "content": "Alkalmazásunk beépített biztonsági funkciókat tartalmaz:\n\n• Csak helyi kommunikáció: Minden kommunikáció peer-to-peer központi szerverek nélkül\n• Felhasználói kontroll: A felhasználók szabályozzák, hogy kivel kapcsolódnak és milyen információkat osztanak meg\n• Nincs profil rendszer: Nincsenek nyilvános profilok vagy felhasználói könyvtárak, amelyeket ki lehetne használni\n• Átmeneti kapcsolatok: A kapcsolatok átmenetiek és felhasználó által kezdeményezettek\n• Titkosítás: Minden kommunikáció végpontok között titkosított\n• Nincs helymeghatározás követés: Nem követjük nyomon és nem tároljuk a felhasználók tartózkodási helyét"
        },
        "contentModeration": {
            "title": "4. Tartalom moderálás",
            "content": "Peer-to-peer architektúránk miatt:\n\n• Közvetlen kommunikáció: Az üzenetek közvetlenül kerülnek elküldésre az eszközök között szerver közvetítés nélkül\n• Felhasználói felelősség: A felhasználók felelősek az általuk megosztott tartalomért\n• Blokkolási képesség: A felhasználók bármikor leválaszthatnak bármely eszközt\n• Nincs tartalom tárolás: Nem tároljuk és nem férünk hozzá a felhasználói kommunikációhoz\n• Közösségi szabványok: A felhasználóknak meg kell felelniük Szolgáltatási feltételeinknek és közösségi irányelveinknek\n\nBár nem tudjuk moderálni a valós idejű peer-to-peer kommunikációt, eszközöket biztosítunk a felhasználóknak önmaguk védelmére."
        },
        "reporting": {
            "title": "5. Jelentési mechanizmusok",
            "content": "Ha nem megfelelő tartalommal, visszaéléssel vagy biztonsági aggályokkal találkozik:\n\n• Azonnali intézkedés: Azonnal váljon le az eszközről\n• Jelentés nekünk: Lépjen kapcsolatba a nearcomapp{'@'}gmail.com címmel részletekkel\n• Bűnüldözés: Jelentse az illegális tevékenységet a helyi hatóságoknak\n• Vészhelyzet: Hívja a segélyhívó szolgálatokat (112 stb.) azonnali fenyegetések esetén\n• Dokumentáció: Mentse el a releváns információkat (eszköznevek, időbélyegek)\n\nKomolyan vesszük az összes jelentést és teljes mértékben együttműködünk a bűnüldöző vizsgálatokkal."
        },
        "privacyProtection": {
            "title": "6. Adatvédelem a kiskorúak számára",
            "content": "Védjük a felhasználók magánéletét, különösen a kiskorúakét:\n\n• Nincs személyes adatgyűjtés: Nem gyűjtünk neveket, e-maileket, telefonszámokat vagy címeket\n• Nincs helymeghatározás követés: A helymeghatározási engedélyek csak a Bluetooth funkcionalitáshoz használatosak, nem követéshez\n• Csak helyi tárolás: Minden adat a felhasználó eszközén marad\n• Nincs harmadik féllel való megosztás: Soha nem osztjuk meg a felhasználói adatokat harmadik felekkel\n• COPPA megfelelés: Tervezésünk eredendően védi a gyermekek magánéletét\n• Szülői kontroll: A szülők figyelemmel kísérhetik az alkalmazás használatát eszköz szintű vezérléseken keresztül"
        },
        "prohibitedContent": {
            "title": "7. Tiltott tartalom és viselkedés",
            "content": "A következők szigorúan tiltottak:\n\n• Gyermekek szexuális bántalmazásával kapcsolatos anyagok (CSAM): Bármilyen kiskorúakat kizsákmányoló tartalom\n• Grooming: Kísérletek kapcsolatok kiépítésére kiskorúakkal kizsákmányolás céljából\n• Zaklatás: Bármely felhasználó megfélemlítése, fenyegetése vagy zaklatása\n• Illegális tartalom: Bármilyen helyi, nemzeti vagy nemzetközi törvényeket sértő tartalom\n• Gyűlöletbeszéd: Erőszakot vagy gyűlöletet népszerűsítő tartalom\n• Szexuális tartalom: Explicit szexuális tartalom vagy kérés\n• Megszemélyesítés: Más személynek való kiadás\n\nA jogsértések azonnali jelentést eredményeznek a hatóságoknak és együttműködést a vizsgálatokkal."
        },
        "parentalGuidance": {
            "title": "8. Szülői útmutatás és források",
            "content": "Javasoljuk a szülőknek és gondviselőknek:\n\n• Felügyeljék a használatot: Figyeljék a gyermekek kommunikációs alkalmazások használatát\n• Beszélgessenek a biztonságról: Beszélgessenek a gyermekekkel az online biztonságról és megfelelő viselkedésről\n• Határokat szabjanak: Állítsanak fel szabályokat arról, hogy a gyermekek kivel kommunikálhatnak\n• Használják az eszköz vezérléseket: Használják a szülői felügyeleti funkciókat az eszközökön\n• Maradjanak tájékozottak: Tekintsék át adatvédelmi irányelvünket és biztonsági irányelveinket\n• Jelentsék az aggályokat: Azonnal lépjenek kapcsolatba velünk, ha biztonsági aggályaik vannak\n\nA szülői részvétel kulcsfontosságú a gyermekek online biztonságának biztosításához."
        },
        "contact": {
            "title": "9. Kapcsolattartási információk",
            "content": "Gyermekvédelmi aggályok, visszaélések jelentése vagy biztonsági irányelveinkkel kapcsolatos kérdések esetén:",
            "emailLabel": "Biztonsági e-mail",
            "emailValue": "nearcomapp{'@'}gmail.com",
            "websiteLabel": "Biztonsági weboldal",
            "websiteValue": "https://nearcomapp.com/csae",
            "responseTimeLabel": "Válaszidő",
            "responseTimeValue": "24-48 órán belül biztonsági jelentések esetén"
        },
        "emergencyResources": {
            "title": "10. Vészhelyzeti források",
            "content": "Ha Ön vagy valaki, akit ismer, közvetlen veszélyben van:\n\n• Segélyhívó szolgálatok: Hívja a 112-t (EU) vagy a helyi segélyhívó számot\n• Nemzeti Eltűnt és Kizsákmányolt Gyermekek Központja (NCMEC): CyberTipline.org vagy 1-800-843-5678\n• FBI Internet Bűncselekmény Panasz Központ: ic3.gov\n• INHOPE Forródrát Hálózat: inhope.org (nemzetközi)\n• Helyi bűnüldözés: Lépjen kapcsolatba a helyi rendőrséggel\n\nNem sürgős aggályok esetén használja a fenti biztonsági kapcsolattartási információinkat. Elkötelezettek vagyunk a hatóságokkal való együttműködés mellett a felhasználók biztonságának biztosítása érdekében."
        }
    }
}
